In [2]:
import pandas as pd

Series

In [62]:
x=[1, 2, 3, -4, 5, 62, 7, 118, 9]
dic = {'name': ['python', 'c++'], 'rank':[1,2], 'user':[212,232]}
var = pd.Series(x)
var1 = pd.Series(x, dtype='float', name='first')
var2 = pd.Series(dic)
var3 = pd.Series(12, index=[1,2,3,4])

DataFrame

In [63]:
x=[1, 2, 3, -4, 5, 62, 7, 118, 9]
var1 = pd.DataFrame(x)
var2 = pd.DataFrame(dic) #no. of data should be equal
var3 = pd.DataFrame(dic, columns=['user', 'rank', 'l'], index=['a', 'k'])

#Using two series as a value and two keys we can make data frames.
d = {'a': pd.Series([1,2,3,4,5]), 'b': pd.Series([9,8,7,6,5])}
v = pd.DataFrame(d)

Csv file reading and conversion

In [64]:
# Convertting dictonary or data to csv file.
data = {'name': ['python', 'c++'], 'rank':[1,2], 'user':[212,232]}
d = pd.DataFrame(data)

#whatever extension you write it make.
d.to_csv('first2.csv', index=False, header=['a', 'b', 'c'])

# #You can't write index like this.
# d.to_csv('first1.csv', index=['f', 'g', 'j'], header=['a', 'b', 'c'])

In [65]:
#reading csv file:
data = pd.read_csv('people.csv')
# data = pd.read_csv('people.csv', nrows=3, usecols=[0, 4], skiprows=[0], index_col="Name", header=2, col = ["col1", "col2"])
# data = pd.read_csv('people.csv', header=None, dtype={"Graduation": "float"}, names = ["col1", "col2", "col3", "col4", "col5", "col6"])
# print(type(data))

In [4]:
df = pd.read_csv("titanic.csv")
# df.loc[0]
# df.reset_index(inplace=True, drop=True)
# lst = [1 for x in range(891)]
# df.index=lst
# x=df[df["Survived"]==0]
# len(x)
# # for multiple condition use &
# df["Pclass"].value_counts()
# df[["Survived", "Sex"]].value_counts()

In [67]:
df.columns
df["Age"].mean()
df["Age"].max()
df["Age"].min()
df["Age"].std()
df["Age"].median()
df["Age"].mode()
df["Age"].count()
df["Age"].unique()
df["Age"].nunique()

88

In [68]:
df["Survived"].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [69]:
df["Sex"].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [70]:
df[["Sex", "Survived"]].value_counts()

Sex     Survived
male    0           468
female  1           233
male    1           109
female  0            81
Name: count, dtype: int64

In [71]:
df[["Sex", "Survived"]].value_counts()

Sex     Survived
male    0           468
female  1           233
male    1           109
female  0            81
Name: count, dtype: int64

In [72]:
468/577

0.8110918544194108

In [73]:
df["Age_Months"]=df["Age"]*12
df["Age_Months"].mean()

356.38941176470587

In [74]:
df.iloc[647]

PassengerId                                    648
Survived                                         1
Pclass                                           1
Name           Simonius-Blumer, Col. Oberst Alfons
Sex                                           male
Age                                           56.0
SibSp                                            0
Parch                                            0
Ticket                                       13213
Fare                                          35.5
Cabin                                          A26
Embarked                                         C
Age_Months                                   672.0
Name: 647, dtype: object

In [75]:
df.index = df["Ticket"]

In [76]:
df.loc['211536'] #this with work with level not index.

PassengerId                      887
Survived                           0
Pclass                             2
Name           Montvila, Rev. Juozas
Sex                             male
Age                             27.0
SibSp                              0
Parch                              0
Ticket                        211536
Fare                            13.0
Cabin                            NaN
Embarked                           S
Age_Months                     324.0
Name: 211536, dtype: object

In [77]:
df.loc["W./C. 6607"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Months
Ticket,,,,,,,,,,,,,
W./C. 6607,784,0,3,"Johnston, Mr. Andrew G",male,NaN,1,2,W./C. 6607,23.45,NaN,S,NaN
W./C. 6607,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,NaN

In [78]:
df.loc["STON/O2. 3101282"]

PassengerId                         3
Survived                            1
Pclass                              3
Name           Heikkinen, Miss. Laina
Sex                            female
Age                              26.0
SibSp                               0
Parch                               0
Ticket               STON/O2. 3101282
Fare                            7.925
Cabin                             NaN
Embarked                            S
Age_Months                      312.0
Name: STON/O2. 3101282, dtype: object

In [79]:
df.reset_index(drop=True, inplace=True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Months
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,264.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,456.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,312.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,420.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,420.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,324.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,228.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,312.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,384.0

In [80]:
df.iloc[400]
df[df["Age"]<=10].count()

PassengerId    64
Survived       64
Pclass         64
Name           64
Sex            64
Age            64
SibSp          64
Parch          64
Ticket         64
Fare           64
Cabin          10
Embarked       64
Age_Months     64
dtype: int64

In [81]:
df[(df["Fare"]<=20) & (df["Sex"]=="male")].count()

PassengerId    373
Survived       373
Pclass         373
Name           373
Sex            373
Age            281
SibSp          373
Parch          373
Ticket         373
Fare           373
Cabin           12
Embarked       373
Age_Months     281
dtype: int64

In [82]:
df[(df["Age"]>=50) & (df["Sex"]=="female")].count()

PassengerId    22
Survived       22
Pclass         22
Name           22
Sex            22
Age            22
SibSp          22
Parch          22
Ticket         22
Fare           22
Cabin          15
Embarked       21
Age_Months     22
dtype: int64

In [83]:
len(df[(df["Survived"]==1) & (df["Age"]>=40)])
df[(df["Survived"]==1) & (df["Age"]>=40)].count()
# df

PassengerId    61
Survived       61
Pclass         61
Name           61
Sex            61
Age            61
SibSp          61
Parch          61
Ticket         61
Fare           61
Cabin          37
Embarked       60
Age_Months     61
dtype: int64

In [84]:
len(df[(df["Sex"]=="female") | (df["Age"]<=10)]) #for or condition use |

347

In [85]:
len(df[(df["Sex"]=="female") | (df["Survived"]==0)])

782

In [86]:
df[df["Ticket"]=="347082"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Months
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.275,NaN,S,468.0
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.0,4,2,347082,31.275,NaN,S,24.0
541,542,0,3,"Andersson, Miss. Ingeborg Constanzia",female,9.0,4,2,347082,31.275,NaN,S,108.0
542,543,0,3,"Andersson, Miss. Sigrid Elisabeth",female,11.0,4,2,347082,31.275,NaN,S,132.0
610,611,0,3,"Andersson, Mrs. Anders Johan (Alfrida Konstant...",female,39.0,1,5,347082,31.275,NaN,S,468.0
813,814,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.0,4,2,347082,31.275,NaN,S,72.0
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.0,4,2,347082,31.275,NaN,S,48.0

In [87]:
#To drop the row (It is index)
df.drop(610, inplace=True)

In [88]:
df[df["Ticket"]=="347082"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Months
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.275,NaN,S,468.0
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.0,4,2,347082,31.275,NaN,S,24.0
541,542,0,3,"Andersson, Miss. Ingeborg Constanzia",female,9.0,4,2,347082,31.275,NaN,S,108.0
542,543,0,3,"Andersson, Miss. Sigrid Elisabeth",female,11.0,4,2,347082,31.275,NaN,S,132.0
813,814,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.0,4,2,347082,31.275,NaN,S,72.0
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.0,4,2,347082,31.275,NaN,S,48.0

In [89]:
df.iloc[609]

PassengerId                          610
Survived                               1
Pclass                                 1
Name           Shutes, Miss. Elizabeth W
Sex                               female
Age                                 40.0
SibSp                                  0
Parch                                  0
Ticket                          PC 17582
Fare                            153.4625
Cabin                               C125
Embarked                               S
Age_Months                         480.0
Name: 609, dtype: object

In [90]:
df.drop("Age_Months", axis=1, inplace=True)

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 890 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  890 non-null    int64
 1   Survived     890 non-null    int64
 2   Pclass       890 non-null    int64
 3   Name         890 non-null    object
 4   Sex          890 non-null    object
 5   Age          713 non-null    float64
 6   SibSp        890 non-null    int64
 7   Parch        890 non-null    int64
 8   Ticket       890 non-null    object
 9   Fare         890 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     888 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 90.4+ KB

In [92]:
df[df["Sex"]=="male"]["Age"].mean()
# .........................................(31st question)........why wrong?

30.72664459161148

In [93]:

df[df["Sex"]=="female"]["Fare"].min()

6.75

In [94]:
df["Ticket"].value_counts().max()

7

In [95]:
df.info() #To know more about data

<class 'pandas.core.frame.DataFrame'>
Index: 890 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  890 non-null    int64
 1   Survived     890 non-null    int64
 2   Pclass       890 non-null    int64
 3   Name         890 non-null    object
 4   Sex          890 non-null    object
 5   Age          713 non-null    float64
 6   SibSp        890 non-null    int64
 7   Parch        890 non-null    int64
 8   Ticket       890 non-null    object
 9   Fare         890 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     888 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 90.4+ KB

In [96]:
df[df["Cabin"].notnull()]
# or
df[df["Cabin"].notna()]

# similarly
df[df["Cabin"].isnull()]
# or
df[df["Cabin"].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [97]:
df[df["Cabin"].notnull()]["Age"].mean()

35.829297297297295

In [98]:
df[df["Cabin"].isnull()]["Fare"].mean()

19.1396610787172

In [99]:
df[(df["Sex"]=="female") & (df["Age"].isnull())].count()

PassengerId    53
Survived       53
Pclass         53
Name           53
Sex            53
Age             0
SibSp          53
Parch          53
Ticket         53
Fare           53
Cabin           7
Embarked       53
dtype: int64

In [100]:
#agg work on dataframe and series both.
df['Age'].agg(['min', 'max', 'mean', 'median'])

min        0.420000
max       80.000000
mean      29.686073
median    28.000000
Name: Age, dtype: float64

In [101]:
df.agg({"Age":['min', 'max', 'mean', 'median'], "Fare":['min', 'max', 'mean']})

              Age        Fare
min      0.420000    0.000000
max     80.000000  512.329200
mean    29.686073   32.205252
median  28.000000         NaN

In [106]:
# df.dropna(inplace=True)   ##It will remove all NaN value.

In [120]:
len(df["Age"].unique())

89

In [16]:
d = df.groupby(["Sex"])
# d.first()
# d["Age"].sum()

In [25]:
df.groupby(["Sex", "Survived"]).get_group(('male', 1))["Age"].max()

80.0

In [35]:
df[df["Name"]=='Razi, Mr. Raihed'].index

Index([859], dtype='int64')

In [43]:
df.loc[859, "Age" ]=38

df.loc[859]

PassengerId                 860
Survived                      0
Pclass                        3
Name           Razi, Mr. Raihed
Sex                        male
Age                        38.0
SibSp                         0
Parch                         0
Ticket                     2629
Fare                     7.2292
Cabin                       NaN
Embarked                      C
Name: 859, dtype: object

In [49]:
df[df["Sex"] == 'male'].index[98]

154

In [56]:
df['Nag'] = [i for i in range(891)]

In [65]:
# df.loc[index] == value_lst   , if alue stored as list
# df.append(dict, ignore_index =True)   , if value are stored as dictnary
# pd.concat([df1, df2], ignore_index =True)

In [ ]:
# df3 = pd.merge(df1,df2, on = "Name", how = "inner" or "outer" or "left" or "right"),   It will merge two data frame with common name

In [ ]:
# df_statistic = df.describe()

# df_statistic.loc["25%"]["Age"]

In [67]:
# df.sample(n=100)  #randomly sample 100 data row

In [75]:
# df[0:4]
# df.iloc[0:4, 2:5]  #row and column index